# Петя перешёл в другую школу. На уроке физкультуры ему понадобилось определить своё место в строю.
# Помогите ему это сделать.
# Программа получает на вход невозрастающую последовательность натуральных чисел,
# означающих рост каждого человека в строю. После этого вводится число X – рост Пети.
# Все числа во входных данных натуральные и не превышают 200.
#
# Выведите номер, под которым Петя должен встать в строй.
# Если в строю есть люди с одинаковым ростом, таким же, как у Пети, то он должен встать после них.
# input: 165 163 160 160 157 157 155 154
# 162
# output: 3
a = [int(i) for i in input().split()]
x = int(input())
i = 0
while i < len(a) and a[i] >= x:
    i += 1
print(i + 1)
