# Август и Беатриса играют в игру. Август загадал натуральное число от 1 до n.
# Беатриса пытается угадать это число, для этого она называет некоторые множества натуральных чисел.
# Август отвечает Беатрисе YES, если среди названных ей чисел есть задуманное или NO в противном случае.
# После нескольких заданныъх вопросов Беатриса запуталась в том, какие вопросы она задавала и какие ответы получила
# и просит вас помочь ей определить, какие числа мог задумать Август.
#
# В первой строке задано n - максимальное число, которое мог загадать Август.
# Далее каждая строка содержит вопрос Беатрисы (множество чисел, разделенных пробелом) и ответ Августа на этот вопрос.
#
# Вы должны вывести через пробел, в порядке возрастания, все числа, которые мог задумать Август.
# input:
# 10
# 1 2 3 4 5
# YES
# 2 4 6 8 10
# NO
# HELP
# output:
# 1 3 5
n = int(input())
possible_numbers = {i for i in range(1, n + 1)}
impossible_numbers = set()
request = input().split()
while 'HELP' not in request:
    request = [int(element) for element in request]
    answer = input()
    if answer == 'YES':
        possible_numbers &= set(request)
    else:
        impossible_numbers |= set(request)
    request = input().split()
possible_numbers -= impossible_numbers
print(*sorted(possible_numbers))
