# В институте биоинформатики по офису передвигается робот.
# Недавно студенты из группы программистов написали для него программу, по которой робот, когда заходит в комнату,
# считает количество программистов в ней и произносит его вслух: "n программистов".
#
# Для того, чтобы это звучало правильно, для каждого n нужно использовать верное окончание слова.
#
# Напишите программу, считывающую с пользовательского ввода целое число n (неотрицательное),
# выводящее это число в консоль вместе с правильным образом изменённым словом "программист", для того,
# чтобы робот мог нормально общаться с людьми, например: 1 программист, 2 программиста, 5 программистов.
#
# В комнате может быть очень много программистов.
# Проверьте, что ваша программа правильно обработает все случаи, как минимум до 1000 человек.
#
# Sample Input 1:
#
# 5
# Sample Output 1:
#
# 5 программистов
# Sample Input 2:
#
# 0
# Sample Output 2:
#
# 0 программистов
# Sample Input 3:
#
# 1
# Sample Output 3:
#
# 1 программист
# Sample Input 4:
#
# 2
# Sample Output 4:
#
# 2 программиста

n = int(input())
if n % 100 // 10 == 1:
    s = "программистов"
elif 2 <= n % 10 <= 4:
    s = "программиста"
elif n % 10 == 1:
    s = "программист"
else:
    s = "программистов"
print(n, s)
