# GC-состав является важной характеристикой геномных последовательностей и определяется как процентное соотношение
# суммы всех гуанинов и цитозинов к общему числу нуклеиновых оснований в геномной последовательности.
#
# Напишите программу, которая вычисляет процентное содержание символов G (гуанин) и C (цитозин) в введенной строке
# (программа не должна зависеть от регистра вводимых символов).
#
# Sample Input:
#
# acggtgttat
# Sample Output:
#
# 40.0

s = input().upper()
ans = (s.count("G") + s.count("C")) / len(s) * 100
print(ans)
